[
  {
    "model": "catalog.blog",
    "pk": 1,
    "fields": {
      "title": "Насколько быстрее стали терминалы в GNOME 46?",
      "slug": "naskolko-byistree-stali-terminalyi-v-gnome-46",
      "content": "VTE (Virtual TErminal library) — это библиотека, лежащая в основе различных эмуляторов терминала GNOME. Она предоставляет GTK-виджет, отображающий элемент терминала, используемый в приложениях наподобие GNOME Terminal, Console, Black Box, Tilix, Terminator, Ptyxis и других. Также она используется во встроенных терминалах Builder и Workbench.\r\n\r\nНа протяжении цикла GNOME 46 в VTE было внесено множество улучшений производительности. Кристиан Хергерт говорил о некоторых из них в своих постах о VTE и о своей работе в GNOME 46. Но насколько же улучшилась производительность? Чего стоит ожидать вам, пользователю, от установки свежего обновления Fedora 40 и запуска любимого терминала?\r\n\r\nДавайте измерим и разберёмся!",
      "preview": "catalog/t_iikbssn8gjgyvpqnueocksnpm.jpeg",
      "created_at": "2024-04-22T12:13:34.289Z",
      "is_published": true,
      "views": 0
    }
  },
  {
    "model": "catalog.blog",
    "pk": 2,
    "fields": {
      "title": "Всё что вы хотели знать про ACL в Active Directory",
      "slug": "vsyo-chto-vyi-hoteli-znat-pro-acl-v-active-directory",
      "content": "Введение\r\nВ данной статье я постарался максимально полно и глубоко рассказать про построение и внутреннее использование ACL (Access Control List) внутри Active Directory. В этой статье нет рассказов про \"null DACL\" и \"empty DACL\" и тому подобного. Если читатель хочет изучить все более простые нюансы использования ACL, то рекомендую почитать другую мою статью или лучше сразу почитать комментарии к моему тестовому коду для этой статьи.\r\nЧто будет в этой статье:\r\nРасскажу про все 22 различных типа ACE, а также разделю их на 4 различных вида;\r\nРасскажу, почему прав вида \"GENERIC\" не существует;\r\nПокажу, как именно флаги из ACCESS_MASK работают при проверках в Active Directory;\r\nРасскажу почему вы не сможете \"сделать RBCD\" имея AllExtendedRights на \"computer\";\r\nРасскажу и дам ссылку на программу для получения всех \"control access rights\" (extended rights, validated rights, property sets);\r\nПокажу, как получить полный список всех атрибутов, связанных control access rights и подчинённых классов для любого объекта в домене;\r\nРасскажу про каждое \"validated right\" в отдельности и покажу как можно обойти их контроль;\r\nКак именно хранятся security descriptors в NTDS.DIT и почему их там мало;\r\nДам таблицу для всех \"extended access rights\" со ссылками на алгоритмы их использования;\r\nСтатья предполагает, что у читателя уже есть какие-то знания по построению ACL. Никаких \"основ\" в данной статье нет, только hardcore.",
      "preview": "catalog/1f929e3a0987461c7522b9c122a5a250.jpg",
      "created_at": "2024-04-22T13:19:04.318Z",
      "is_published": true,
      "views": 0
    }
  }
]